karen-2025/Clock/STC8H4K64TL.h
#define DMA_SPI_CFG     (*(unsigned char volatile xdata *)0xfa20)	/*  SPI_DMA配置寄存器 */
#define DMA_SPI_CR      (*(unsigned char volatile xdata *)0xfa21)	/*  SPI_DMA控制寄存器 */
#define DMA_SPI_STA     (*(unsigned char volatile xdata *)0xfa22)	/*  SPI_DMA状态寄存器 */
#define DMA_SPI_AMT     (*(unsigned char volatile xdata *)0xfa23)	/*  SPI_DMA传输总字节数 */
#define DMA_SPI_DONE    (*(unsigned char volatile xdata *)0xfa24)	/*  SPI_DMA传输完成字节数 */
#define DMA_SPI_TXAH    (*(unsigned char volatile xdata *)0xfa25)	/*  SPI_DMA发送高地址 */
#define DMA_SPI_TXAL    (*(unsigned char volatile xdata *)0xfa26)	/*  SPI_DMA发送低地址 */
#define DMA_SPI_RXAH    (*(unsigned char volatile xdata *)0xfa27)	/*  SPI_DMA接收高地址 */
#define DMA_SPI_RXAL    (*(unsigned char volatile xdata *)0xfa28)	/*  SPI_DMA接收地地址 */
#define DMA_SPI_CFG2    (*(unsigned char volatile xdata *)0xfa29)	/*  SPI_DMA配置寄存器2 */

#define DMA_UR1T_CFG     (*(unsigned char volatile xdata *)0xfa30)	/*  UR1T_DMA配置寄存器 */
#define DMA_UR1T_CR      (*(unsigned char volatile xdata *)0xfa31)	/*  UR1T_DMA控制寄存器 */
#define DMA_UR1T_STA     (*(unsigned char volatile xdata *)0xfa32)	/*  UR1T_DMA状态寄存器 */
#define DMA_UR1T_AMT     (*(unsigned char volatile xdata *)0xfa33)	/*  UR1T_DMA传输总字节数 */
#define DMA_UR1T_DONE    (*(unsigned char volatile xdata *)0xfa34)	/*  UR1T_DMA传输完成字节数 */
#define DMA_UR1T_TXAH    (*(unsigned char volatile xdata *)0xfa35)	/*  UR1T_DMA发送高地址 */
#define DMA_UR1T_TXAL    (*(unsigned char volatile xdata *)0xfa36)	/*  UR1T_DMA发送低地址 */
#define DMA_UR1R_CFG     (*(unsigned char volatile xdata *)0xfa38)	/*  UR1R_DMA配置寄存器 */
#define DMA_UR1R_CR      (*(unsigned char volatile xdata *)0xfa39)	/*  UR1R_DMA控制寄存器 */
#define DMA_UR1R_STA     (*(unsigned char volatile xdata *)0xfa3a)	/*  UR1R_DMA状态寄存器 */
#define DMA_UR1R_AMT     (*(unsigned char volatile xdata *)0xfa3b)	/*  UR1R_DMA传输总字节数 */
#define DMA_UR1R_DONE    (*(unsigned char volatile xdata *)0xfa3c)	/*  UR1R_DMA传输完成字节数 */
#define DMA_UR1R_TXAH    (*(unsigned char volatile xdata *)0xfa3d)	/*  UR1R_DMA发送高地址 */
#define DMA_UR1R_TXAL    (*(unsigned char volatile xdata *)0xfa3e)	/*  UR1R_DMA发送低地址 */

#define DMA_UR2T_CFG     (*(unsigned char volatile xdata *)0xfa40)	/*  UR2T_DMA配置寄存器 */
#define DMA_UR2T_CR      (*(unsigned char volatile xdata *)0xfa41)	/*  UR2T_DMA控制寄存器 */
#define DMA_UR2T_STA     (*(unsigned char volatile xdata *)0xfa42)	/*  UR2T_DMA状态寄存器 */
#define DMA_UR2T_AMT     (*(unsigned char volatile xdata *)0xfa43)	/*  UR2T_DMA传输总字节数 */
#define DMA_UR2T_DONE    (*(unsigned char volatile xdata *)0xfa44)	/*  UR2T_DMA传输完成字节数 */
#define DMA_UR2T_TXAH    (*(unsigned char volatile xdata *)0xfa45)	/*  UR2T_DMA发送高地址 */
#define DMA_UR2T_TXAL    (*(unsigned char volatile xdata *)0xfa46)	/*  UR2T_DMA发送低地址 */
#define DMA_UR2R_CFG     (*(unsigned char volatile xdata *)0xfa48)	/*  UR2R_DMA配置寄存器 */
#define DMA_UR2R_CR      (*(unsigned char volatile xdata *)0xfa49)	/*  UR2R_DMA控制寄存器 */
#define DMA_UR2R_STA     (*(unsigned char volatile xdata *)0xfa4a)	/*  UR2R_DMA状态寄存器 */
#define DMA_UR2R_AMT     (*(unsigned char volatile xdata *)0xfa4b)	/*  UR2R_DMA传输总字节数 */
#define DMA_UR2R_DONE    (*(unsigned char volatile xdata *)0xfa4c)	/*  UR2R_DMA传输完成字节数 */
#define DMA_UR2R_TXAH    (*(unsigned char volatile xdata *)0xfa4d)	/*  UR2R_DMA发送高地址 */
#define DMA_UR2R_TXAL    (*(unsigned char volatile xdata *)0xfa4e)	/*  UR2R_DMA发送低地址 */

#define DMA_UR3T_CFG     (*(unsigned char volatile xdata *)0xfa50)	/*  UR3T_DMA配置寄存器 */
#define DMA_UR3T_CR      (*(unsigned char volatile xdata *)0xfa51)	/*  UR3T_DMA控制寄存器 */
#define DMA_UR3T_STA     (*(unsigned char volatile xdata *)0xfa52)	/*  UR3T_DMA状态寄存器 */
#define DMA_UR3T_AMT     (*(unsigned char volatile xdata *)0xfa53)	/*  UR3T_DMA传输总字节数 */
#define DMA_UR3T_DONE    (*(unsigned char volatile xdata *)0xfa54)	/*  UR3T_DMA传输完成字节数 */
#define DMA_UR3T_TXAH    (*(unsigned char volatile xdata *)0xfa55)	/*  UR3T_DMA发送高地址 */
#define DMA_UR3T_TXAL    (*(unsigned char volatile xdata *)0xfa56)	/*  UR3T_DMA发送低地址 */
#define DMA_UR3R_CFG     (*(unsigned char volatile xdata *)0xfa58)	/*  UR3R_DMA配置寄存器 */
#define DMA_UR3R_CR      (*(unsigned char volatile xdata *)0xfa59)	/*  UR3R_DMA控制寄存器 */
#define DMA_UR3R_STA     (*(unsigned char volatile xdata *)0xfa5a)	/*  UR3R_DMA状态寄存器 */
#define DMA_UR3R_AMT     (*(unsigned char volatile xdata *)0xfa5b)	/*  UR3R_DMA传输总字节数 */
#define DMA_UR3R_DONE    (*(unsigned char volatile xdata *)0xfa5c)	/*  UR3R_DMA传输完成字节数 */
#define DMA_UR3R_TXAH    (*(unsigned char volatile xdata *)0xfa5d)	/*  UR3R_DMA发送高地址 */
#define DMA_UR3R_TXAL    (*(unsigned char volatile xdata *)0xfa5e)	/*  UR3R_DMA发送低地址 */

#define DMA_UR4T_CFG     (*(unsigned char volatile xdata *)0xfa60)	/*  UR4T_DMA配置寄存器 */
#define DMA_UR4T_CR      (*(unsigned char volatile xdata *)0xfa61)	/*  UR4T_DMA控制寄存器 */
#define DMA_UR4T_STA     (*(unsigned char volatile xdata *)0xfa62)	/*  UR4T_DMA状态寄存器 */
#define DMA_UR4T_AMT     (*(unsigned char volatile xdata *)0xfa63)	/*  UR4T_DMA传输总字节数 */
#define DMA_UR4T_DONE    (*(unsigned char volatile xdata *)0xfa64)	/*  UR4T_DMA传输完成字节数 */
#define DMA_UR4T_TXAH    (*(unsigned char volatile xdata *)0xfa65)	/*  UR4T_DMA发送高地址 */
#define DMA_UR4T_TXAL    (*(unsigned char volatile xdata *)0xfa66)	/*  UR4T_DMA发送低地址 */
#define DMA_UR4R_CFG     (*(unsigned char volatile xdata *)0xfa68)	/*  UR4R_DMA配置寄存器 */
#define DMA_UR4R_CR      (*(unsigned char volatile xdata *)0xfa69)	/*  UR4R_DMA控制寄存器 */
#define DMA_UR4R_STA     (*(unsigned char volatile xdata *)0xfa6a)	/*  UR4R_DMA状态寄存器 */
#define DMA_UR4R_AMT     (*(unsigned char volatile xdata *)0xfa6b)	/*  UR4R_DMA传输总字节数 */
#define DMA_UR4R_DONE    (*(unsigned char volatile xdata *)0xfa6c)	/*  UR4R_DMA传输完成字节数 */
#define DMA_UR4R_TXAH    (*(unsigned char volatile xdata *)0xfa6d)	/*  UR4R_DMA发送高地址 */
#define DMA_UR4R_TXAL    (*(unsigned char volatile xdata *)0xfa6e)	/*  UR4R_DMA发送低地址 */

#define DMA_LCM_CFG     (*(unsigned char volatile xdata *)0xfa70)	/*  LCM_DMA配置寄存器 */
#define DMA_LCM_CR      (*(unsigned char volatile xdata *)0xfa71)	/*  LCM_DMA控制寄存器 */
#define DMA_LCM_STA     (*(unsigned char volatile xdata *)0xfa72)	/*  LCM_DMA状态寄存器 */
#define DMA_LCM_AMT     (*(unsigned char volatile xdata *)0xfa73)	/*  LCM_DMA传输总字节数 */
#define DMA_LCM_DONE    (*(unsigned char volatile xdata *)0xfa74)	/*  LCM_DMA传输完成字节数 */
#define DMA_LCM_TXAH    (*(unsigned char volatile xdata *)0xfa75)	/*  LCM_DMA发送高地址 */
#define DMA_LCM_TXAL    (*(unsigned char volatile xdata *)0xfa76)	/*  LCM_DMA发送低地址 */
#define DMA_LCM_RXAH    (*(unsigned char volatile xdata *)0xfa77)	/*  LCM_DMA接收高地址 */
#define DMA_LCM_RXAL    (*(unsigned char volatile xdata *)0xfa78)	/*  LCM_DMA接收地地址 */

#define COMEN     (*(unsigned char volatile xdata *)0xfb00)	/* COM使能寄存器 */
#define SEGENL    (*(unsigned char volatile xdata *)0xfb01)	/* SEG使能寄存器 */
#define SEGENH    (*(unsigned char volatile xdata *)0xfb02)	/* SEG使能寄存器 */
#define LEDCTRL   (*(unsigned char volatile xdata *)0xfb03)	/* LED控制寄存器 */
#define LEDCKS    (*(unsigned char volatile xdata *)0xfb04)	/* LED时钟分频寄存器 */

#define COM0_DAL  (*(unsigned char volatile xdata *)0xfb10)	/* 共阳模式显示数据 */
#define COM1_DAL  (*(unsigned char volatile xdata *)0xfb11)	/* 共阳模式显示数据 */
#define COM2_DAL  (*(unsigned char volatile xdata *)0xfb12)	/* 共阳模式显示数据 */
#define COM3_DAL  (*(unsigned char volatile xdata *)0xfb13)	/* 共阳模式显示数据 */
#define COM4_DAL  (*(unsigned char volatile xdata *)0xfb14)	/* 共阳模式显示数据 */
#define COM5_DAL  (*(unsigned char volatile xdata *)0xfb15)	/* 共阳模式显示数据 */
#define COM6_DAL  (*(unsigned char volatile xdata *)0xfb16)	/* 共阳模式显示数据 */
#define COM7_DAL  (*(unsigned char volatile xdata *)0xfb17)	/* 共阳模式显示数据 */
#define COM0_DAH  (*(unsigned char volatile xdata *)0xfb18)	/* 共阳模式显示数据 */
#define COM1_DAH  (*(unsigned char volatile xdata *)0xfb19)	/* 共阳模式显示数据 */
#define COM2_DAH  (*(unsigned char volatile xdata *)0xfb1a)	/* 共阳模式显示数据 */
#define COM3_DAH  (*(unsigned char volatile xdata *)0xfb1b)	/* 共阳模式显示数据 */
#define COM4_DAH  (*(unsigned char volatile xdata *)0xfb1c)	/* 共阳模式显示数据 */
#define COM5_DAH  (*(unsigned char volatile xdata *)0xfb1d)	/* 共阳模式显示数据 */
#define COM6_DAH  (*(unsigned char volatile xdata *)0xfb1e)	/* 共阳模式显示数据 */
#define COM7_DAH  (*(unsigned char volatile xdata *)0xfb1f)	/* 共阳模式显示数据 */

