karen-2025/Clock/STC8H4K64TL.h
#define COM0_DCL  (*(unsigned char volatile xdata *)0xfb20)	/* 共阴模式显示数据 */
#define COM1_DCL  (*(unsigned char volatile xdata *)0xfb21)	/* 共阴模式显示数据 */
#define COM2_DCL  (*(unsigned char volatile xdata *)0xfb22)	/* 共阴模式显示数据 */
#define COM3_DCL  (*(unsigned char volatile xdata *)0xfb23)	/* 共阴模式显示数据 */
#define COM4_DCL  (*(unsigned char volatile xdata *)0xfb24)	/* 共阴模式显示数据 */
#define COM5_DCL  (*(unsigned char volatile xdata *)0xfb25)	/* 共阴模式显示数据 */
#define COM6_DCL  (*(unsigned char volatile xdata *)0xfb26)	/* 共阴模式显示数据 */
#define COM7_DCL  (*(unsigned char volatile xdata *)0xfb27)	/* 共阴模式显示数据 */
#define COM0_DCH  (*(unsigned char volatile xdata *)0xfb28)	/* 共阴模式显示数据 */
#define COM1_DCH  (*(unsigned char volatile xdata *)0xfb29)	/* 共阴模式显示数据 */
#define COM2_DCH  (*(unsigned char volatile xdata *)0xfb2a)	/* 共阴模式显示数据 */
#define COM3_DCH  (*(unsigned char volatile xdata *)0xfb2b)	/* 共阴模式显示数据 */
#define COM4_DCH  (*(unsigned char volatile xdata *)0xfb2c)	/* 共阴模式显示数据 */
#define COM5_DCH  (*(unsigned char volatile xdata *)0xfb2d)	/* 共阴模式显示数据 */
#define COM6_DCH  (*(unsigned char volatile xdata *)0xfb2e)	/* 共阴模式显示数据 */
#define COM7_DCH  (*(unsigned char volatile xdata *)0xfb2f)	/* 共阴模式显示数据 */

#define TSCHEN     (*(unsigned int  volatile xdata *)0xfb40)	/* 触摸按键使能寄存器 */
#define TSCFG      (*(unsigned int  volatile xdata *)0xfb42)	/* 触摸按键配置寄存器1 */
#define TSSTA      (*(unsigned int  volatile xdata *)0xfb46)	/* 触摸按键状态寄存器1 */
#define TSDAT      (*(unsigned int  volatile xdata *)0xfb49)	/* 触摸按键数据 */
#define TSTH00     (*(unsigned int  volatile xdata *)0xfb50)	/* 触摸按键0门槛值高字节 */
#define TSTH01     (*(unsigned int  volatile xdata *)0xfb52)	/* 触摸按键1门槛值高字节 */
#define TSTH02     (*(unsigned int  volatile xdata *)0xfb54)	/* 触摸按键2门槛值高字节 */
#define TSTH03     (*(unsigned int  volatile xdata *)0xfb56)	/* 触摸按键3门槛值高字节 */
#define TSTH04     (*(unsigned int  volatile xdata *)0xfb58)	/* 触摸按键4门槛值高字节 */
#define TSTH05     (*(unsigned int  volatile xdata *)0xfb5a)	/* 触摸按键5门槛值高字节 */
#define TSTH06     (*(unsigned int  volatile xdata *)0xfb5c)	/* 触摸按键6门槛值高字节 */
#define TSTH07     (*(unsigned int  volatile xdata *)0xfb5e)	/* 触摸按键7门槛值高字节 */
#define TSTH08     (*(unsigned int  volatile xdata *)0xfb60)	/* 触摸按键8门槛值高字节 */
#define TSTH09     (*(unsigned int  volatile xdata *)0xfb62)	/* 触摸按键9门槛值高字节 */
#define TSTH10     (*(unsigned int  volatile xdata *)0xfb64)	/* 触摸按键10门槛值高字节 */
#define TSTH11     (*(unsigned int  volatile xdata *)0xfb66)	/* 触摸按键11门槛值高字节 */
#define TSTH12     (*(unsigned int  volatile xdata *)0xfb68)	/* 触摸按键12门槛值高字节 */
#define TSTH13     (*(unsigned int  volatile xdata *)0xfb6a)	/* 触摸按键13门槛值高字节 */
#define TSTH14     (*(unsigned int  volatile xdata *)0xfb6c)	/* 触摸按键14门槛值高字节 */
#define TSTH15     (*(unsigned int  volatile xdata *)0xfb6e)	/* 触摸按键15门槛值高字节 */

#define TSCHEN1    (*(unsigned char volatile xdata *)0xfb40)	/* 触摸按键使能寄存器1 */
#define TSCHEN2    (*(unsigned char volatile xdata *)0xfb41)	/* 触摸按键使能寄存器2 */
#define TSCFG1     (*(unsigned char volatile xdata *)0xfb42)	/* 触摸按键配置寄存器1 */
#define TSCFG2     (*(unsigned char volatile xdata *)0xfb43)	/* 触摸按键配置寄存器2 */
#define TSWUTC     (*(unsigned char volatile xdata *)0xfb44)	/* 触摸按键唤醒控制寄存器 */
#define TSCTRL     (*(unsigned char volatile xdata *)0xfb45)	/* 触摸按键控制寄存器  */
#define TSSTA1     (*(unsigned char volatile xdata *)0xfb46)	/* 触摸按键状态寄存器1 */
#define TSSTA2     (*(unsigned char volatile xdata *)0xfb47)	/* 触摸按键状态寄存器2 */

#define TSRT       (*(unsigned char volatile xdata *)0xfb48)	/* 触摸按键时间控制寄存器 */
#define TSDATH     (*(unsigned char volatile xdata *)0xfb49)	/* 触摸按键数据高字节 */
#define TSDATL     (*(unsigned char volatile xdata *)0xfb4a)	/* 触摸按键数据低字节 */

#define TSTH00H    (*(unsigned char volatile xdata *)0xfb50)	/* 触摸按键0门槛值高字节 */
#define TSTH00L    (*(unsigned char volatile xdata *)0xfb51)	/* 触摸按键0门槛值低字节 */
#define TSTH01H    (*(unsigned char volatile xdata *)0xfb52)	/* 触摸按键1门槛值高字节 */
#define TSTH01L    (*(unsigned char volatile xdata *)0xfb53)	/* 触摸按键1门槛值低字节 */
#define TSTH02H    (*(unsigned char volatile xdata *)0xfb54)	/* 触摸按键2门槛值高字节 */
#define TSTH02L    (*(unsigned char volatile xdata *)0xfb55)	/* 触摸按键2门槛值低字节 */
#define TSTH03H    (*(unsigned char volatile xdata *)0xfb56)	/* 触摸按键3门槛值高字节 */
#define TSTH03L    (*(unsigned char volatile xdata *)0xfb57)	/* 触摸按键3门槛值低字节 */
#define TSTH04H    (*(unsigned char volatile xdata *)0xfb58)	/* 触摸按键4门槛值高字节 */
#define TSTH04L    (*(unsigned char volatile xdata *)0xfb59)	/* 触摸按键4门槛值低字节 */
#define TSTH05H    (*(unsigned char volatile xdata *)0xfb5a)	/* 触摸按键5门槛值高字节 */
#define TSTH05L    (*(unsigned char volatile xdata *)0xfb5b)	/* 触摸按键5门槛值低字节 */
#define TSTH06H    (*(unsigned char volatile xdata *)0xfb5c)	/* 触摸按键6门槛值高字节 */
#define TSTH06L    (*(unsigned char volatile xdata *)0xfb5d)	/* 触摸按键6门槛值低字节 */
#define TSTH07H    (*(unsigned char volatile xdata *)0xfb5e)	/* 触摸按键7门槛值高字节 */
#define TSTH07L    (*(unsigned char volatile xdata *)0xfb5f)	/* 触摸按键7门槛值低字节 */
#define TSTH08H    (*(unsigned char volatile xdata *)0xfb60)	/* 触摸按键8门槛值高字节 */
#define TSTH08L    (*(unsigned char volatile xdata *)0xfb61)	/* 触摸按键8门槛值低字节 */
#define TSTH09H    (*(unsigned char volatile xdata *)0xfb62)	/* 触摸按键9门槛值高字节 */
#define TSTH09L    (*(unsigned char volatile xdata *)0xfb63)	/* 触摸按键9门槛值低字节 */
#define TSTH10H    (*(unsigned char volatile xdata *)0xfb64)	/* 触摸按键10门槛值高字节 */
#define TSTH10L    (*(unsigned char volatile xdata *)0xfb65)	/* 触摸按键10门槛值低字节 */
#define TSTH11H    (*(unsigned char volatile xdata *)0xfb66)	/* 触摸按键11门槛值高字节 */
#define TSTH11L    (*(unsigned char volatile xdata *)0xfb67)	/* 触摸按键11门槛值低字节 */
#define TSTH12H    (*(unsigned char volatile xdata *)0xfb68)	/* 触摸按键12门槛值高字节 */
#define TSTH12L    (*(unsigned char volatile xdata *)0xfb69)	/* 触摸按键12门槛值低字节 */
#define TSTH13H    (*(unsigned char volatile xdata *)0xfb6a)	/* 触摸按键13门槛值高字节 */
#define TSTH13L    (*(unsigned char volatile xdata *)0xfb6b)	/* 触摸按键13门槛值低字节 */
#define TSTH14H    (*(unsigned char volatile xdata *)0xfb6c)	/* 触摸按键14门槛值高字节 */
#define TSTH14L    (*(unsigned char volatile xdata *)0xfb6d)	/* 触摸按键14门槛值低字节 */
#define TSTH15H    (*(unsigned char volatile xdata *)0xfb6e)	/* 触摸按键15门槛值高字节 */
#define TSTH15L    (*(unsigned char volatile xdata *)0xfb6f)	/* 触摸按键15门槛值低字节 */

#define LCDCFG     (*(unsigned char volatile xdata *)0xfb80)	/* LCD配置寄存器 */
#define LCDCFG2    (*(unsigned char volatile xdata *)0xfb81)	/* LCD配置寄存器2 */
#define DBLEN      (*(unsigned char volatile xdata *)0xfb82)	/* 死区时间长度配置寄存器 */
#define COMLENL    (*(unsigned char volatile xdata *)0xfb83)	/* COM时间长度配置低位 */
#define COMLENM    (*(unsigned char volatile xdata *)0xfb84)	/* COM时间长度配置中位 */
#define COMLENH    (*(unsigned char volatile xdata *)0xfb85)	/* COM时间长度配置高位 */
#define BLINKRATE  (*(unsigned char volatile xdata *)0xfb86)	/* 闪烁率配置寄存器 */
#define LCDCR      (*(unsigned char volatile xdata *)0xfb87)	/* LCD控制寄存器 */
#define COMON      (*(unsigned char volatile xdata *)0xfb88)	/* COM使能寄存器 */
#define SEGON1     (*(unsigned char volatile xdata *)0xfb8a)	/* SEG线使能寄存器1 */
#define SEGON2     (*(unsigned char volatile xdata *)0xfb8b)	/* SEG线使能寄存器2 */
#define SEGON3     (*(unsigned char volatile xdata *)0xfb8c)	/* SEG线使能寄存器3 */
#define SEGON4     (*(unsigned char volatile xdata *)0xfb8d)	/* SEG线使能寄存器4 */
#define SEGON5     (*(unsigned char volatile xdata *)0xfb8e)	/* SEG线使能寄存器5 */
#define C0SEGV0    (*(unsigned char volatile xdata *)0xfb90)	/* C0SEG  7~0数据寄存器  */
#define C0SEGV1    (*(unsigned char volatile xdata *)0xfb91)	/* C0SEG 15~8数据寄存器  */
#define C0SEGV2    (*(unsigned char volatile xdata *)0xfb92)	/* C0SEG 23~16数据寄存器 */
#define C0SEGV3    (*(unsigned char volatile xdata *)0xfb93)	/* C0SEG 31~24数据寄存器 */
#define C0SEGV4    (*(unsigned char volatile xdata *)0xfb94)	/* C0SEG 39~32数据寄存器 */
#define C1SEGV0    (*(unsigned char volatile xdata *)0xfb98)	/* C1SEG  7~0数据寄存器  */
#define C1SEGV1    (*(unsigned char volatile xdata *)0xfb99)	/* C1SEG 15~8数据寄存器  */
#define C1SEGV2    (*(unsigned char volatile xdata *)0xfb9a)	/* C1SEG 23~16数据寄存器 */
#define C1SEGV3    (*(unsigned char volatile xdata *)0xfb9b)	/* C1SEG 31~24数据寄存器 */
#define C1SEGV4    (*(unsigned char volatile xdata *)0xfb9c)	/* C1SEG 39~32数据寄存器 */
#define C2SEGV0    (*(unsigned char volatile xdata *)0xfba0)	/* C2SEG  7~0数据寄存器  */
#define C2SEGV1    (*(unsigned char volatile xdata *)0xfba1)	/* C2SEG 15~8数据寄存器  */
#define C2SEGV2    (*(unsigned char volatile xdata *)0xfba2)	/* C2SEG 23~16数据寄存器 */
#define C2SEGV3    (*(unsigned char volatile xdata *)0xfba3)	/* C2SEG 31~24数据寄存器 */
#define C2SEGV4    (*(unsigned char volatile xdata *)0xfba4)	/* C2SEG 39~32数据寄存器 */
#define C3SEGV0    (*(unsigned char volatile xdata *)0xfba8)	/* C3SEG  7~0数据寄存器  */
#define C3SEGV1    (*(unsigned char volatile xdata *)0xfba9)	/* C3SEG 15~8数据寄存器  */
#define C3SEGV2    (*(unsigned char volatile xdata *)0xfbaa)	/* C3SEG 23~16数据寄存器 */
#define C3SEGV3    (*(unsigned char volatile xdata *)0xfbab)	/* C3SEG 31~24数据寄存器 */
#define C3SEGV4    (*(unsigned char volatile xdata *)0xfbac)	/* C3SEG 39~32数据寄存器 */

